Q1. List any five functions of the pandas library with execution.
Answer. 

describe(): Calculate the statistics i.e., mean,std.. for series or data frame.
iloc      : which means integer location goes with index only. iloc is used to retrive rows and columns,we have to give index values also.
loc       : which goes with index and named values also,we have to give index values also.
read_csv  : which reads comaseparatedvalues into pandas dataframe.
to_excel  : this method is used to export data frame to excel
to_csv    : this method is used to export data frame to csv file

In [11]:
#execution for above
#importing pandas library as pd
import pandas as pd
#taking data
data = {'name': ['John', 'Jane', 'Bob'], 'age': [25, 30, 35]}
#creating data frame
df = pd.DataFrame(data)
print(df)
print("...describe execution is...")
print(df.describe())
print("...iloc execution is...")
print(df.iloc[0:1])
print("...loc execution is...")
print(df.loc[0:1])

   name  age
0  John   25
1  Jane   30
2   Bob   35
...describe execution is...
        age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0
...iloc execution is...
   name  age
0  John   25
...loc execution is...
   name  age
0  John   25
1  Jane   30

In [26]:
#Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
#DataFrame with a new index that starts from 1 and increments by 2 for each row.

#importing pandas library as pd
import pandas as pd
#initialising data
data = {'A':[1,2,3],'B':[2,4,6],'C':[3,6,9]}
#creating data frame
df = pd.DataFrame(data)
#reindexing using reindex function based on condition
new = df.reindex([1,1+2])

In [14]:
df

   A  B  C
0  1  2  3
1  2  4  6
2  3  6  9

In [27]:
new

     A    B    C
1  2.0  4.0  6.0
3  NaN  NaN  NaN

In [28]:
#Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
#iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
#function should print the sum to the console.

#importing pandas lib as pd
import pandas as pd
#initialising data
data = {'ex':['A','B','C','D','E'],'values':[10,20,30,40,50]}
#converting into dataframe
df = pd.DataFrame(data)

In [29]:
df

  ex  values
0  A      10
1  B      20
2  C      30
3  D      40
4  E      50

In [30]:
df.head(3)
#taking first 3 values using head function

  ex  values
0  A      10
1  B      20
2  C      30

In [37]:
df.columns

Index(['ex', 'values'], dtype='object')

In [42]:
x= df['values'][0:3]
#store it in new variable x

In [44]:
x
#calling x

0    10
1    20
2    30
Name: values, dtype: int64

In [43]:
sum(x)
#using sum function adding first 3 values that is the out put we required.

60

In [45]:
print(f"Sum of first three values is {sum(x)}")

Sum of first three values is 60

In [ ]:
#Q5. How are DataFrame.size() and DataFrame.shape() different?

# Size() function returns no.of elements in the dataframe 
# shape function returns no.of rows and columns in a dataframe

In [1]:
#Q6. Which function of pandas do we use to read an excel file?

###  we can use pandas module read_excel() function to read excel files.

In [9]:
'''Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.'''

#importing pandas library as pd
import pandas as pd
#initialising data
data = {'A':[0,1,2,3,4],'B':[3,8,6,2,9],'C':[5,2,9,3,1],'D':[1,7,4,5,2]}
#creating data frame using pandas 
df = pd.DataFrame(data)
df

   A  B  C  D
0  0  3  5  1
1  1  8  2  7
2  2  6  9  4
3  3  2  3  5
4  4  9  1  2

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.loc[1:6:3,['A','B','C']]
#using loc function starting from 1 to 6 with diff 3 w.r.t. columns A,B,C

   A  B  C
1  1  8  2
4  4  9  1

In [24]:
#Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
#median, and standard deviation of the values in the 'Values' column.
#importing pandas module as pd
import pandas as pd
#initialising data
data = {'ID'     :[114, 345, 157788, 5626], 
        'Product':['shirt', 'trousers', 'tie', 'belt'], 
        'Color'  :['White', 'Black', 'Red', 'Brown'], 
        'Discount':[10, 10, 10, 10]}
#creating data frame
df = pd.DataFrame(data)
df

       ID   Product  Color  Discount
0     114     shirt  White        10
1     345  trousers  Black        10
2  157788       tie    Red        10
3    5626      belt  Brown        10

In [21]:
df.describe()
#using describe function to calculate statistical results of our data frame

                  ID  Discount
count       4.000000       4.0
mean    40968.250000      10.0
std     77921.427966       0.0
min       114.000000      10.0
25%       287.250000      10.0
50%      2985.500000      10.0
75%     43666.500000      10.0
max    157788.000000      10.0

In [25]:
df['ID']
#taking single column

0       114
1       345
2    157788
3      5626
Name: ID, dtype: int64

In [26]:
df['ID'].std()
#calculating individual results

77921.42796593245

In [27]:
df['ID'].mean()

40968.25

In [28]:
df['ID'].median()

2985.5

In [73]:
'''Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.'''
#importing pandas module as pd
import pandas as pd
data = {'Date':['2023-1-1',
                '2023-1-2',
                '2023-1-3',
                '2023-1-4',
                '2023-1-5']}
#creating dataframe
df = pd.DataFrame(data)

In [74]:
df

       Date
0  2023-1-1
1  2023-1-2
2  2023-1-3
3  2023-1-4
4  2023-1-5

In [75]:
df.dtypes

Date    object
dtype: object

In [77]:
df['Day'] = ['sunday','monday','tuesday','wednesday','thursday']
#creating new column that contains day

In [78]:
df

       Date        Day
0  2023-1-1     sunday
1  2023-1-2     monday
2  2023-1-3    tuesday
3  2023-1-4  wednesday
4  2023-1-5   thursday

In [ ]:
'''Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.'''

In [86]:
# Load library
import pandas as pd

# calling DataFrame constructor
df = pd.DataFrame()

# Create 6 dates
df['time'] = pd.date_range('1/1/2023', periods = 31, freq ='2H')
print(df['time']) # print dataframe

# Extract features - year, month, day, hour, and minute
df['year'] = df['time'].dt.year
df['month'] = df['time'].dt.month
df['day'] = df['time'].dt.day
df['hour'] = df['time'].dt.hour
df['minute'] = df['time'].dt.minute

# Show six rows
df.head(6)

0    2023-01-01 00:00:00
1    2023-01-01 02:00:00
2    2023-01-01 04:00:00
3    2023-01-01 06:00:00
4    2023-01-01 08:00:00
5    2023-01-01 10:00:00
6    2023-01-01 12:00:00
7    2023-01-01 14:00:00
8    2023-01-01 16:00:00
9    2023-01-01 18:00:00
10   2023-01-01 20:00:00
11   2023-01-01 22:00:00
12   2023-01-02 00:00:00
13   2023-01-02 02:00:00
14   2023-01-02 04:00:00
15   2023-01-02 06:00:00
16   2023-01-02 08:00:00
17   2023-01-02 10:00:00
18   2023-01-02 12:00:00
19   2023-01-02 14:00:00
20   2023-01-02 16:00:00
21   2023-01-02 18:00:00
22   2023-01-02 20:00:00
23   2023-01-02 22:00:00
24   2023-01-03 00:00:00
25   2023-01-03 02:00:00
26   2023-01-03 04:00:00
27   2023-01-03 06:00:00
28   2023-01-03 08:00:00
29   2023-01-03 10:00:00
30   2023-01-03 12:00:00
Name: time, dtype: datetime64[ns]

                 time  year  month  day  hour  minute
0 2023-01-01 00:00:00  2023      1    1     0       0
1 2023-01-01 02:00:00  2023      1    1     2       0
2 2023-01-01 04:00:00  2023      1    1     4       0
3 2023-01-01 06:00:00  2023      1    1     6       0
4 2023-01-01 08:00:00  2023      1    1     8       0
5 2023-01-01 10:00:00  2023      1    1    10       0

In [79]:
'''Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.'''

import pandas as pd
data = {'Date':[1,2,3,4,5,6,7],
       'sales':[2000,4000,3000,5000,6000,4000,7000]}
df = pd.DataFrame(data)

In [80]:
df

   Date  sales
0     1   2000
1     2   4000
2     3   3000
3     4   5000
4     5   6000
5     6   4000
6     7   7000

In [81]:
df.dtypes

Date     int64
sales    int64
dtype: object

In [53]:
df['average_column'] = 0

In [54]:
df

   Date  sales  average_column
0     1   2000               0
1     2   4000               0
2     3   3000               0
3     4   5000               0
4     5   6000               0
5     6   4000               0
6     7   7000               0

In [57]:
df.columns

Index(['Date', 'sales', 'average_column'], dtype='object')

In [59]:
df['sales'].mean()

4428.571428571428